Revit 2027 API
CategorySet Properties
The CategorySet type exposes the following members.
Properties
Name | Description
IsEmpty | Test to see if the set is empty.
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
Size | Returns the number of categories that are in the set.
Top
See Also
Reference
CategorySet Class
Autodesk.Revit.DB Namespace